#Student Name: Ash Hoskins, Student #S559245
#Course: CSIS 44-609 - Data Analytics Fundamentals
#Professor Denise Case
#Domain: Geospatial data
#Module 4: Task 1.

## Task 1. Create DataFrame

In [92]:
import pandas as pd

In [93]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100,87,90], 'Sam': [94,77,90], 'Katie': [100,81,82], 'Bob': [83,65,85]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## Task 2. Custom Index

In [94]:
grades.index = ['Exam 1', 'Exam 2', 'Exam 3']
grades

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65
Exam 3     70   90   90     82   85

In [95]:
grades['Eva']

Exam 1    100
Exam 2     87
Exam 3     90
Name: Eva, dtype: int64

In [96]:
grades.Sam

Exam 1    94
Exam 2    77
Exam 3    90
Name: Sam, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

In [97]:
grades.loc['Exam 1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Exam 1, dtype: int64

In [98]:
grades.iloc[0] # I prefer this method, indexing is important to know

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Exam 1, dtype: int64

In [99]:
grades.iloc[0:2] #Iloc is for row lookup. [0:2] is Row 0 (labels), Exam 1, Exam 2.

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65

## Task 3. Accessing Subsets (at, iat)

In [100]:
grades.at['Exam 2', 'Eva']

87

In [101]:
grades.iat[2,0]

70

In [102]:
grades #DF Check

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65
Exam 3     70   90   90     82   85

## Task 4. Describe (By Column)

In [103]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

In [104]:
pd.set_option("precision",2) #Intentional Error for Lookup process

OptionError: Pattern matched multiple keys

![About Multiple Key Error](multierror.png)

In [ ]:
pd.set_option("display.precision",2)

        Wally  Eva  Sam  Katie  Bob
Exam 1     87  100   94    100   83
Exam 2     96   87   77     81   65
Exam 3     70   90   90     82   85

## Task 5. Transpose (rows <--> columns)

In [ ]:
grades.mean() #Mean value of all exam grades per column.

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [ ]:
round(grades['Wally'].sum() / 3, 2) #Just practicing how to get the mean threw sum()

84.33

In [ ]:
grades.T #Wow

       Exam 1  Exam 2  Exam 3
Wally      87      96      70
Eva       100      87      90
Sam        94      77      90
Katie     100      81      82
Bob        83      65      85

In [ ]:
grades.T.describe()

       Exam 1  Exam 2  Exam 3
count    5.00    5.00    5.00
mean    92.80   81.20   83.40
std      7.66   11.54    8.23
min     83.00   65.00   70.00
25%     87.00   77.00   82.00
50%     94.00   81.00   85.00
75%    100.00   87.00   90.00
max    100.00   96.00   90.00

## Task 6. Sort

In [ ]:
grades.sort_index(ascending=False) #Descending order Sort by Row index.

        Wally  Eva  Sam  Katie  Bob
Exam 3     70   90   90     82   85
Exam 2     96   87   77     81   65
Exam 1     87  100   94    100   83

In [ ]:
grades.sort_index(axis=1) #alphabetic order of Columns.  axis{0 or ‘index’, 1 or ‘columns’}, default 0

        Bob  Eva  Katie  Sam  Wally
Exam 1   83  100    100   94     87
Exam 2   65   87     81   77     96
Exam 3   85   90     82   90     70

In [ ]:
grades.sort_index(axis='columns') #just practice

        Bob  Eva  Katie  Sam  Wally
Exam 1   83  100    100   94     87
Exam 2   65   87     81   77     96
Exam 3   85   90     82   90     70